Revit 2027 API
ScheduleDefinition.GetFilter Method
 Gets a filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFilter GetFilter(
	int index
)
Public Function GetFilter (
	index As Integer
) As ScheduleFilter
public:
ScheduleFilter^ GetFilter(
	int index
)
member GetFilter :
        index : int -> ScheduleFilter
Parameters
index Int32
 The index of the filter.
Return Value
ScheduleFilter
 A copy of the filter.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid filter index.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace